// components/book/book.js
Component({
  /**
   * 组件的属性列表
   */
  properties: {

  },

  /**
   * 组件的初始数据
   */
  data: {
    img: "/images/img1.jpg",
    bookName: "《卓有成效的管理者》",
    author: "美彼得·德鲁克",
    ISBN: "9787111280712",
    publisher: "机械工业出版社",
    date: "2009",
    code: "F270",
    price: "30￥",
    storage: "63",
    address: "三楼二排",
    tag: "工商管理",
    content: "卓有成效是管理者必须做到的事，但是在所有的知识组织中，每一位知识工作者其实都是管理者——即使他没有所谓的职权，只要他能为组织作出突出的贡献。管理者的成效往往是决定组织工作成效的关键因素；并不是只有高级管理人员才是管理者，所有负责行动和决策而又有助于提高机构工作效能的人，都应该像管理者一样工作和思考。"
  },

  /**
   * 组件的方法列表
   */
  methods: {

  }
})
